---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RefPlaneFailures.AlreadyHaveTwoClosurePlanes
source: html/fec1ec25-47f2-832f-e8ce-9cc8ba02ba6c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RefPlaneFailures.AlreadyHaveTwoClosurePlanes Property

No more than two closure planes are allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId AlreadyHaveTwoClosurePlanes { get; }
```